; domain
(define (domain gripper-strips)

    (:predicates (room ?r)
                (ball ?b)
                (gripper ?g)
                (at-robby ?r)
                (at ?b ?r)
                (free ?g)
                (carry ?o ?g)
    )

    (:action move
        :parameters (?from ?to)
        :precondition (and (room ?from)(room ?to)(at-robby ?from))
        :effect (and
            (at-robby ?to)
            (not (at-robby ?from))
        )
    )
    (:action pick
        :parameters (?obj ?room ?gripper)
        :precondition (and (ball ?obj)(room ?room)(gripper ?gripper)(at ?obj ?room)(at-robby ?room)(free ?gripper))
        :effect (and
            (carry ?obj ?gripper)
            (not (at ?obj ?room))
            (not (free ?gripper))
        )
    )
    (:action drop
        :parameters (?obj ?room ?gripper)
        :precondition (and (ball ?obj)(room ?room)(gripper ?gripper)(carry ?obj ?gripper)(at-robby ?room))
        :effect (and
            (at ?obj ?room)
            (free ?gripper)
            (not (carry ?obj ?gripper))
        )
    )
)

; problem
(define (problem gripper-26)
(:domain gripper-strips)
(:objects rooma roomb left right ball1 ball2 ball3 ball4 ball5 ball6 ball7 ball8 ball9 ball10 ball11 ball12 ball13 ball14 ball15 ball16 ball17 ball18 ball19 ball20 ball21 ball22 ball23 ball24 ball25 ball26 )
(:init
(room rooma)
(room roomb)
(gripper left)
(gripper right)
(ball ball1)
(ball ball2)
(ball ball3)
(ball ball4)
(ball ball5)
(ball ball6)
(ball ball7)
(ball ball8)
(ball ball9)
(ball ball10)
(ball ball11)
(ball ball12)
(ball ball13)
(ball ball14)
(ball ball15)
(ball ball16)
(ball ball17)
(ball ball18)
(ball ball19)
(ball ball20)
(ball ball21)
(ball ball22)
(ball ball23)
(ball ball24)
(ball ball25)
(ball ball26)
(free left)
(free right)
(at ball1 rooma)
(at ball2 rooma)
(at ball3 rooma)
(at ball4 rooma)
(at ball5 rooma)
(at ball6 rooma)
(at ball7 rooma)
(at ball8 rooma)
(at ball9 rooma)
(at ball10 rooma)
(at ball11 rooma)
(at ball12 rooma)
(at ball13 rooma)
(at ball14 rooma)
(at ball15 rooma)
(at ball16 rooma)
(at ball17 rooma)
(at ball18 rooma)
(at ball19 roomb)
(at ball20 roomb)
(at ball21 roomb)
(at ball22 roomb)
(at ball23 roomb)
(at ball24 roomb)
(at ball25 roomb)
(at ball26 roomb)
(at-robby rooma)
)
(:goal
(and
(at ball1 rooma)
(at ball2 rooma)
(at ball3 rooma)
(at ball4 rooma)
(at ball5 rooma)
(at ball6 rooma)
(at ball7 rooma)
(at ball8 rooma)
(at ball9 rooma)
(at ball10 rooma)
(at ball11 rooma)
(at ball12 rooma)
(at ball13 rooma)
(at ball14 rooma)
(at ball15 rooma)
(at ball16 rooma)
(at ball17 roomb)
(at ball18 roomb)
(at ball19 roomb)
(at ball20 roomb)
(at ball21 roomb)
(at ball22 roomb)
(at ball23 roomb)
(at ball24 roomb)
(at ball25 roomb)
(at ball26 roomb)
)
)
)

; plan
1. (pick ball18 rooma left)
   deleted: (at ball18 rooma) (free left)
   added: (carry ball18 left)
   goals met: 24 of 26
2. (pick ball17 rooma right)
   deleted: (at ball17 rooma) (free right)
   added: (carry ball17 right)
   goals met: 24 of 26
3. (move rooma roomb)
   deleted: (at-robby rooma)
   added: (at-robby roomb)
   goals met: 24 of 26
4. (drop ball18 roomb left)
   deleted: (carry ball18 left)
   added: (at ball18 roomb) (free left)
   goals met: 25 of 26
5. (drop ball17 roomb right)
   deleted: (carry ball17 right)
   added: (at ball17 roomb) (free right)
   goals met: 26 of 26
